#include<bits/stdc++.h> // সব স্ট্যান্ডার্ড লাইব্রেরি ইনক্লুড করা হয়
using namespace std;   // std namespace ব্যবহার করি, যেন বারবার std:: না লিখতে হয়

int main(){
    int n, num, sum=0;      // n = কয়টি সংখ্যা নিবে, num = প্রতিবার ইনপুট, sum = সব সংখ্যার যোগফল
    float avg=0;            // avg ভ্যারিয়েবলটা দশমিক সহ গড় রাখবে

    cin>>n;                 // ইউজার থেকে সংখ্যা কয়টি ইনপুট নিবে সেটা নিচ্ছি

    // n বার ইনপুট নেওয়ার জন্য লুপ চলছে
    for (int i=1; i<=n; i++)
    {
        cin>>num;           // প্রতিবার একটি সংখ্যা ইনপুট নিচ্ছি
        sum += num;         // ইনপুট হওয়া সংখ্যাটিকে যোগফলে যোগ করছি
    }

    avg = (float) sum / n;  // গড় বের করার সময় sum কে float এ কাস্ট করছি যেন দশমিক মান ঠিক থাকে

    // গড় (avg) দশমিকের পরে ৫ ঘর পর্যন্ত দেখানোর জন্য fixed এবং setprecision(5) ব্যবহার করেছি
    cout << fixed << setprecision(5) << "Avg: " << avg << endl;

    return 0;               // প্রোগ্রাম সফলভাবে শেষ
}
