#include<bits/stdc++.h> // সব ধরনের standard লাইব্রেরি একসাথে ইনক্লুড করা হয়েছে
using namespace std;    // standard namespace ব্যবহার করা হয়েছে

int main()
{
    int n; // n নামের একটি integer ভেরিয়েবল ডিক্লেয়ার করা হয়েছে

    cout<<"Input the value: "; // ইউজারকে সংখ্যা ইনপুট দেওয়ার জন্য প্রম্পট দেখানো হচ্ছে
    cin>>n; // ইউজার থেকে সংখ্যা ইনপুট নেওয়া হচ্ছে

    if(n%2==0) // যদি n কে ২ দিয়ে ভাগ করলে ভাগশেষ ০ হয়, তাহলে এটি একটি জোড় সংখ্যা
    {
        cout<<n<<" is Even."; // জোড় সংখ্যা হলে তা প্রিন্ট করা হচ্ছে
    }
    else // অন্যথায় (মানে যদি n বিজোড় হয়)
    {
        cout<<n<<" is Odd."; // বিজোড় সংখ্যা হলে তা প্রিন্ট করা হচ্ছে
    }

    return 0; // প্রোগ্রাম সফলভাবে শেষ
}
