#include <iostream> // ইনপুট ও আউটপুট ব্যবহারের জন্য প্রয়োজনীয় হেডার ফাইল
using namespace std;

int main() {
    int n, sum = 0; // n ইনপুট নেওয়ার জন্য এবং sum দিয়ে বিজোড় সংখ্যাগুলোর যোগফল রাখার জন্য

    // ইউজার থেকে একটি সংখ্যা ইনপুট নেওয়া হচ্ছে
    cout << "Input the N: ";
    cin >> n;

    // 1 থেকে শুরু করে n পর্যন্ত সব বিজোড় সংখ্যা যোগ করা হবে
    for(int i = 1; i <= n; i += 2) {
        sum += i; // sum = sum + i → প্রতিবার বিজোড় সংখ্যাটি যোগ হচ্ছে
    }

    // মোট বিজোড় সংখ্যার যোগফল প্রিন্ট করা হচ্ছে
    cout << "Sum of odd number: " << sum << endl;

    return 0; // প্রোগ্রাম সফলভাবে শেষ
}
